package routes

import (
	"github.com/gin-gonic/gin"
	"gorm.io/gorm"
)

/*

routes/routes.go — маршрутизация (роутинг)

Зачем: Здесь ты определяешь, какие URL-адреса обрабатывает твой сервер и какие функции вызываются.

В нём ты создаёшь экземпляр gin.Engine и описываешь:

Публичные маршруты (/register, /login, /articles).

Приватные маршруты (например, /auth/articles, которые требуют JWT).

💡 Тут не должно быть логики, только маршруты и подключение к контроллерам.

*/
func SetGroup(r *gin.Engine, db *gorm.DB){
	group1 := r.Group("/app")

	r.Get 
}